# Homebrew Setup
tap "homebrew/bundle"
tap "homebrew/services"
brew "mas"

# Security Setup
brew "ykman"
mas "1Password for Safari", id: 1569813296

MacOS Utilities
cask "dropbox"
cask "rectangle"
cask "raycast"
# Testing if I can replace Divvy with Rectangle
# mas "Divvy", id: 413857545

Browsers
cask "arc"
cask "google-chrome"
cask "firefox"

Blogquist
cask "logseq"
cask "anytype"
cask "notion"
mas "Kindle", id: 405399194
mas "Reeder", id: 880001334

# Productivity
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "iMovie", id: 408981434
mas "GarageBand", id: 682658836
cask "spotify"
cask "vlc"
cask "obsidian"

# Gaming
cask "steam"

# Messaging
mas "Slack", id: 803453959
mas "WhatsApp", id: 1147396723
cask "discord"

# Personal
mas "Day One", id: 1055511498

# Terminal Setup
cask "warp"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
tap "romkatv/powerlevel10k"
brew "powerlevel10k"
brew "tmux"

# Developer Tools
cask "zed"
cask "visual-studio-code"
brew "docker"
brew "chezmoi"
brew "1password-cli"

# Source Code Management Setup
brew "git"
brew "gh"
brew "gnupg"
brew "openssh"

Deployment Setup
brew "flyctl"
brew "vercel-cli"
